In [74]:
%run supportvectors-common.ipynb

<center><img src="https://d4x5p7s4.rocketcdn.me/wp-content/uploads/2016/03/logo-poster-smaller.png"/> </center>
<div style="color:#aaa;font-size:8pt">
<hr/>
&copy; SupportVectors. All rights reserved. <blockquote>This notebook is the intellectual property of SupportVectors, and part of its training material.
Only the participants in SupportVectors workshops are allowed to study the notebooks for educational purposes currently, but is prohibited from copying or using it for any other purposes without written permission.

<b> These notebooks are chapters and sections from Asif Qamar's textbook that he is writing on Data Science. So we request you to not circulate the material to others.</b>
 </blockquote>
 <hr/>
</div>

# Query a database using a natural language query

Most of us have been querying the databases using a query language. Of these query languages, SQL is perhaps the most prevalent, mostly owing to its power and expressiveness.

This this lab, we will see how the large language models and the `langchain` agents can provide a completely new, natural language based interface to the database.

## Setup

In order to run this lab, we will need the following:

* A relational database server, such as mysql.

* If you do not yet have a database server on your machine, consider installing mysql. To install it on your local machine, visit: https://www.mysql.com/

* Next, create a schema named `foodmart` in the database server.

* finally, uncompress and untar the script: `footmart_mysql.tar.gz` and use it to import the data into your `foodmart` schema.

For this, one a sql-shell and login to it. Then, import data as follows:
```
mysql> use foodmart;
mysql> source foodmart_mysql.sql;
```

## Getting started

Let us now get started. We will use the `sql-agent` from the `langchain`, and the `SqlDatabaseToolkit`.

In [54]:
from langchain.agents import create_sql_agent
from langchain.agents.agent_toolkits import SQLDatabaseToolkit
from langchain.sql_database import SQLDatabase
from langchain.llms.openai import OpenAI
from langchain.agents import AgentExecutor
from langchain import OpenAI, SQLDatabase, SQLDatabaseChain
from IPython.display import Markdown, HTML

In [55]:
!pip install pymysql

Requirement already satisfied: pymysql in /home/asif/anaconda3/lib/python3.10/site-packages (1.0.3)

In [56]:
username  = 'nlp'                  # change it to a valid user on your db
password  = '!NLP#123___password'  # fill in the appropriate password
uri       = f"mysql+pymysql://{username}:{password}@localhost/foodmart"

db = SQLDatabase.from_uri(uri)
toolkit = SQLDatabaseToolkit(db=db)

agent = create_sql_agent(
    llm=OpenAI(temperature=0),
    toolkit=toolkit,
    verbose=True
)

## Querying the database with nlp

Let us now try out a few natural language queries.

### How many employees are there?

In [57]:
query = 'How many employees are there?. Show also the sql query used to find this.'

agent.run(query)

> Entering new AgentExecutor chain...
Action: list_tables_sql_db
Action Input: ""
Observation: agg_g_ms_pcat_sales_fact_1997, inventory_fact_1997, agg_l_04_sales_fact_1997, product_class, sales_fact_1997, warehouse, salary, department, inventory_fact_1998, warehouse_class, agg_l_03_sales_fact_1997, agg_ll_01_sales_fact_1997, category, region, position, agg_l_05_sales_fact_1997, agg_lc_100_sales_fact_1997, employee_closure, expense_fact, store, agg_pl_01_sales_fact_1997, currency, reserve_employee, agg_lc_06_sales_fact_1997, product, agg_c_14_sales_fact_1997, customer, sales_fact_1998, store_ragged, agg_c_10_sales_fact_1997, time_by_day, promotion, account, days, agg_c_special_sales_fact_1997, sales_fact_dec_1998, employee
Thought: I should query the employee table to get the number of employees.
Action: query_sql_db
Action Input: SELECT COUNT(*) FROM employee
Observation: [(1155,)]
Thought: I now know the final answer
Final Answer: There are 1155 employees. The SQL query used to find this was: SELECT COUNT(*) FROM employee.

> Finished chain.

'There are 1155 employees. The SQL query used to find this was: SELECT COUNT(*) FROM employee.'

### Min, max and average salary of the employees?

In [32]:
query = 'Retrieve all the minimum, maximum, and the average salary.'
agent_executor.run(query)

> Entering new AgentExecutor chain...
Action: list_tables_sql_db
Action Input: ""
Observation: agg_g_ms_pcat_sales_fact_1997, inventory_fact_1997, agg_l_04_sales_fact_1997, product_class, sales_fact_1997, warehouse, salary, department, inventory_fact_1998, warehouse_class, agg_l_03_sales_fact_1997, agg_ll_01_sales_fact_1997, category, region, position, agg_l_05_sales_fact_1997, agg_lc_100_sales_fact_1997, employee_closure, expense_fact, store, agg_pl_01_sales_fact_1997, currency, reserve_employee, agg_lc_06_sales_fact_1997, product, agg_c_14_sales_fact_1997, customer, sales_fact_1998, store_ragged, agg_c_10_sales_fact_1997, time_by_day, promotion, account, days, agg_c_special_sales_fact_1997, sales_fact_dec_1998, employee
Thought: I should check the schema of the salary table to see what columns I can query.
Action: schema_sql_db
Action Input: "salary"
Observation:
CREATE TABLE salary (
	pay_date DATETIME NOT NULL,
	employee_id INTEGER NOT NULL,
	department_id INTEGER NOT NULL,
	currency_id INTEGER NOT NULL,
	salary_paid DECIMAL(10, 4) NOT NULL,
	overtime_paid DECIMAL(10, 4) NOT NULL,
	vacation_accrued DOUBLE NOT NULL,
	vacation_used DOUBLE NOT NULL
)COLLATE latin1_general_ci DEFAULT CHARSET=latin1 ENGINE=MyISAM

/*
3 rows from salary table:
pay_date	employee_id	department_id	currency_id	salary_paid	overtime_paid	vacation_accrued	vacation_used
1997-01-01 00:00:00	1	1	1	72.0000	0.0000	1.0000000000	0E-10
1997-01-01 00:00:00	2	1	1	36.0000	0.0000	1.0000000000	0E-10
1997-01-01 00:00:00	6	2	1	22.5000	0.0000	1.0000000000	0E-10
*/
Thought: I should query the database for the minimum, maximum, and average salary.
Action: query_sql_db
Action Input: SELECT MIN(salary_paid), MAX(salary_paid), AVG(salary_paid) FROM salary
Observation: [(Decimal('3.2000'), Decimal('154.5455'), Decimal('12.77773579'))]
Thought: I now know the final answer.
Final Answer: The minimum salary is 3.20, the maximum salary is 154.55, and the average salary is 12.78.

> Finished chain.

'The minimum salary is 3.20, the maximum salary is 154.55, and the average salary is 12.78.'

### The highest earners

In [42]:
query = """Return the full name and salary for each of the top 20 different highest earning employees. 
Show each row of the result in this format:

<tr><td>[employee full name] </td><td>[salary]</td></tr>

"""

result = agent_executor.run(query)
display(HTML("<table> " + result + "</table>"))

> Entering new AgentExecutor chain...
Action: list_tables_sql_db
Action Input: ""
Observation: agg_g_ms_pcat_sales_fact_1997, inventory_fact_1997, agg_l_04_sales_fact_1997, product_class, sales_fact_1997, warehouse, salary, department, inventory_fact_1998, warehouse_class, agg_l_03_sales_fact_1997, agg_ll_01_sales_fact_1997, category, region, position, agg_l_05_sales_fact_1997, agg_lc_100_sales_fact_1997, employee_closure, expense_fact, store, agg_pl_01_sales_fact_1997, currency, reserve_employee, agg_lc_06_sales_fact_1997, product, agg_c_14_sales_fact_1997, customer, sales_fact_1998, store_ragged, agg_c_10_sales_fact_1997, time_by_day, promotion, account, days, agg_c_special_sales_fact_1997, sales_fact_dec_1998, employee
Thought: I should check the schema of the salary and employee tables to see what columns I can query.
Action: schema_sql_db
Action Input: "salary, employee"
Observation:
CREATE TABLE employee (
	employee_id INTEGER NOT NULL,
	full_name VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci NOT NULL,
	first_name VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci NOT NULL,
	last_name VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci NOT NULL,
	position_id INTEGER,
	position_title VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci,
	store_id INTEGER NOT NULL,
	department_id INTEGER NOT NULL,
	birth_date DATE NOT NULL,
	hire_date DATETIME,
	end_date DATETIME,
	salary DECIMAL(10, 4) NOT NULL,
	supervisor_id INTEGER,
	education_level VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci NOT NULL,
	marital_status VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci NOT NULL,
	gender VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci NOT NULL,
	management_role VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci
)COLLATE latin1_general_ci DEFAULT CHARSET=latin1 ENGINE=MyISAM

/*
3 rows from employee table:
employee_id	full_name	first_name	last_name	position_id	position_title	store_id	department_id	birth_date	hire_date	end_date	salary	supervisor_id	education_level	marital_status	gender	management_role
1	Sheri Nowmer	Sheri	Nowmer	1	President	0	1	1961-08-26	1994-12-01 00:00:00	None	80000.0000	0	Graduate Degree	S	F	Senior Management
2	Derrick Whelply	Derrick	Whelply	2	VP Country Manager	0	1	1915-07-03	1994-12-01 00:00:00	None	40000.0000	1	Graduate Degree	M	M	Senior Management
4	Michael Spence	Michael	Spence	2	VP Country Manager	0	1	1969-06-20	1998-01-01 00:00:00	None	40000.0000	1	Graduate Degree	S	M	Senior Management
*/


CREATE TABLE salary (
	pay_date DATETIME NOT NULL,
	employee_id INTEGER NOT NULL,
	department_id INTEGER NOT NULL,
	currency_id INTEGER NOT NULL,
	salary_paid DECIMAL(10, 4) NOT NULL,
	overtime_paid DECIMAL(10, 4) NOT NULL,
	vacation_accrued DOUBLE NOT NULL,
	vacation_used DOUBLE NOT NULL
)COLLATE latin1_general_ci DEFAULT CHARSET=latin1 ENGINE=MyISAM

/*
3 rows from salary table:
pay_date	employee_id	department_id	currency_id	salary_paid	overtime_paid	vacation_accrued	vacation_used
1997-01-01 00:00:00	1	1	1	72.0000	0.0000	1.0000000000	0E-10
1997-01-01 00:00:00	2	1	1	36.0000	0.0000	1.0000000000	0E-10
1997-01-01 00:00:00	6	2	1	22.5000	0.0000	1.0000000000	0E-10
*/
Thought: I should construct a query to get the top 20 highest earning employees and their full name and salary.
Action: query_checker_sql_db
Action Input: "SELECT full_name, salary FROM employee ORDER BY salary DESC LIMIT 20"
Observation:

SELECT full_name, salary FROM employee ORDER BY salary DESC LIMIT 20
Thought: The query looks correct, I should execute it.
Action: query_sql_db
Action Input: "SELECT full_name, salary FROM employee ORDER BY salary DESC LIMIT 20"
Observation: [('Sheri Nowmer', Decimal('80000.0000')), ('Darren Stanz', Decimal('50000.0000')), ('Donna Arnold', Decimal('45000.0000')), ('Derrick Whelply', Decimal('40000.0000')), ('Michael Spence', Decimal('40000.0000')), ('Laurie Borges', Decimal('35000.0000')), ('Pedro Castillo', Decimal('35000.0000')), ('Maya Gutierrez', Decimal('35000.0000')), ('Beverly Baker', Decimal('30000.0000')), ('Roberta Damstra', Decimal('25000.0000')), ('Bryan Rutledge', Decimal('17000.0000')), ('Jacqueline Wyllie', Decimal('17000.0000')), ('Daniel Wolter', Decimal('17000.0000')), ('Peggy Planck', Decimal('17000.0000')), ('Eric Long', Decimal('17000.0000')), ('Brenda Blumberg', Decimal('17000.0000')), ('Mary Solimena', Decimal('17000.0000')), ('Charles Macaluso', Decimal('16000.0000')), ('Peggy Medina', Decimal('15000.0000')), ('Rebecca Kanagaki', Decimal('15000.0000'))]
Thought: I now know the final answer
Final Answer: <tr><td>Sheri Nowmer</td><td>80000.0000</td></tr><tr><td>Darren Stanz</td><td>50000.0000</td></tr><tr><td>Donna Arnold</td><td>45000.0000</td></tr><tr><td>Derrick Whelply</td><td>40000.0000</td></tr><tr><td>Michael Spence</td><td>40000.0000</td></tr><tr><td>Laurie Borges</td><td>35000.0000</td></tr><tr><td>Pedro Castillo</td><td>35000.0000</td></tr><tr><td>Maya Gutierrez</td><td>35000.0000</td></tr><tr><td>Beverly Baker</td><td>30000.0000</td></tr><tr><td>Roberta Damstra</td><td>25000.0000</td></tr><tr><td>Bryan Rutledge</td><td>17000.0000</td></tr><tr><td>

> Finished chain.

### Who specifically is the highest paid?

In [26]:
query = """
Who earned the highest salary, and how much did the employee earn?. 
For this employee, find the full name, title, gender, and education level. Return the answer in this format:

> **Query used** [query]
>
> **Employee name** [employee], of gender [gender] and education level [education level] with title [title]
>
> ** Salary** [salary]

"""
result = agent_executor.run(query)
display (Markdown(result))

> Entering new AgentExecutor chain...
Action: list_tables_sql_db
Action Input: ""
Observation: agg_g_ms_pcat_sales_fact_1997, inventory_fact_1997, agg_l_04_sales_fact_1997, product_class, sales_fact_1997, warehouse, salary, department, inventory_fact_1998, warehouse_class, agg_l_03_sales_fact_1997, agg_ll_01_sales_fact_1997, category, region, position, agg_l_05_sales_fact_1997, agg_lc_100_sales_fact_1997, employee_closure, expense_fact, store, agg_pl_01_sales_fact_1997, currency, reserve_employee, agg_lc_06_sales_fact_1997, product, agg_c_14_sales_fact_1997, customer, sales_fact_1998, store_ragged, agg_c_10_sales_fact_1997, time_by_day, promotion, account, days, agg_c_special_sales_fact_1997, sales_fact_dec_1998, employee
Thought: I should look at the schema of the salary and employee tables to see what columns I can query.
Action: schema_sql_db
Action Input: "salary, employee"
Observation:
CREATE TABLE employee (
	employee_id INTEGER NOT NULL,
	full_name VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci NOT NULL,
	first_name VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci NOT NULL,
	last_name VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci NOT NULL,
	position_id INTEGER,
	position_title VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci,
	store_id INTEGER NOT NULL,
	department_id INTEGER NOT NULL,
	birth_date DATE NOT NULL,
	hire_date DATETIME,
	end_date DATETIME,
	salary DECIMAL(10, 4) NOT NULL,
	supervisor_id INTEGER,
	education_level VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci NOT NULL,
	marital_status VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci NOT NULL,
	gender VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci NOT NULL,
	management_role VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci
)COLLATE latin1_general_ci DEFAULT CHARSET=latin1 ENGINE=MyISAM

/*
3 rows from employee table:
employee_id	full_name	first_name	last_name	position_id	position_title	store_id	department_id	birth_date	hire_date	end_date	salary	supervisor_id	education_level	marital_status	gender	management_role
1	Sheri Nowmer	Sheri	Nowmer	1	President	0	1	1961-08-26	1994-12-01 00:00:00	None	80000.0000	0	Graduate Degree	S	F	Senior Management
2	Derrick Whelply	Derrick	Whelply	2	VP Country Manager	0	1	1915-07-03	1994-12-01 00:00:00	None	40000.0000	1	Graduate Degree	M	M	Senior Management
4	Michael Spence	Michael	Spence	2	VP Country Manager	0	1	1969-06-20	1998-01-01 00:00:00	None	40000.0000	1	Graduate Degree	S	M	Senior Management
*/


CREATE TABLE salary (
	pay_date DATETIME NOT NULL,
	employee_id INTEGER NOT NULL,
	department_id INTEGER NOT NULL,
	currency_id INTEGER NOT NULL,
	salary_paid DECIMAL(10, 4) NOT NULL,
	overtime_paid DECIMAL(10, 4) NOT NULL,
	vacation_accrued DOUBLE NOT NULL,
	vacation_used DOUBLE NOT NULL
)COLLATE latin1_general_ci DEFAULT CHARSET=latin1 ENGINE=MyISAM

/*
3 rows from salary table:
pay_date	employee_id	department_id	currency_id	salary_paid	overtime_paid	vacation_accrued	vacation_used
1997-01-01 00:00:00	1	1	1	72.0000	0.0000	1.0000000000	0E-10
1997-01-01 00:00:00	2	1	1	36.0000	0.0000	1.0000000000	0E-10
1997-01-01 00:00:00	6	2	1	22.5000	0.0000	1.0000000000	0E-10
*/
Thought: I should use query_sql_db to query the salary and employee tables to find the employee with the highest salary.
Action: query_sql_db
Action Input: SELECT e.full_name, e.position_title, e.gender, e.education_level, s.salary_paid FROM salary s INNER JOIN employee e ON s.employee_id = e.employee_id ORDER BY s.salary_paid DESC LIMIT 10
Observation: [('Brenda Blumberg', 'Store Manager', 'F', 'Graduate Degree', Decimal('154.5455')), ('Bryan Rutledge', 'Store Manager', 'M', 'Bachelors Degree', Decimal('154.5455')), ('Peggy Planck', 'Store Manager', 'F', 'Bachelors Degree', Decimal('154.5455')), ('Brenda Blumberg', 'Store Manager', 'F', 'Graduate Degree', Decimal('154.5455')), ('Bryan Rutledge', 'Store Manager', 'M', 'Bachelors Degree', Decimal('154.5455')), ('Peggy Planck', 'Store Manager', 'F', 'Bachelors Degree', Decimal('154.5455')), ('Brenda Blumberg', 'Store Manager', 'F', 'Graduate Degree', Decimal('154.5455')), ('Bryan Rutledge', 'Store Manager', 'M', 'Bachelors Degree', Decimal('154.5455')), ('Peggy Planck', 'Store Manager', 'F', 'Bachelors Degree', Decimal('154.5455')), ('Brenda Blumberg', 'Store Manager', 'F', 'Graduate Degree', Decimal('154.5455'))]
Thought: I now know the final answer
Final Answer:
> **Query used** SELECT e.full_name, e.position_title, e.gender, e.education_level, s.salary_paid FROM salary s INNER JOIN employee e ON s.employee_id = e.employee_id ORDER BY s.salary_paid DESC LIMIT 10
>
> **Employee name** Brenda Blumberg, of gender F and education level Graduate Degree with title Store Manager
>
> **Salary** 154.5455

> Finished chain.

> **Query used** SELECT e.full_name, e.position_title, e.gender, e.education_level, s.salary_paid FROM salary s INNER JOIN employee e ON s.employee_id = e.employee_id ORDER BY s.salary_paid DESC LIMIT 10
>
> **Employee name** Brenda Blumberg, of gender F and education level Graduate Degree with title Store Manager
>
> **Salary** 154.5455

### Stores and their total sales.

In [59]:
query = """
Consider all the stores. For each store, return the name of the store, the state it belongs to, and the total store sales for that store.
Return the results in the following format, for each store:

<tr><td>[store name] </td><td>[state]</td><td>[total store sales]</td></tr>
"""


result = agent.run(query)

html = f"""
<table>
<tr><td><b>STORE NAME</b> </td><td> <b>STATE</b></td><td><b>TOTAL SALE </b></td></tr>

{result}
</table>
"""

display(HTML(html))

> Entering new AgentExecutor chain...
Action: list_tables_sql_db
Action Input: ""
Observation: agg_g_ms_pcat_sales_fact_1997, inventory_fact_1997, agg_l_04_sales_fact_1997, product_class, sales_fact_1997, warehouse, salary, department, inventory_fact_1998, warehouse_class, agg_l_03_sales_fact_1997, agg_ll_01_sales_fact_1997, category, region, position, agg_l_05_sales_fact_1997, agg_lc_100_sales_fact_1997, employee_closure, expense_fact, store, agg_pl_01_sales_fact_1997, currency, reserve_employee, agg_lc_06_sales_fact_1997, product, agg_c_14_sales_fact_1997, customer, sales_fact_1998, store_ragged, agg_c_10_sales_fact_1997, time_by_day, promotion, account, days, agg_c_special_sales_fact_1997, sales_fact_dec_1998, employee
Thought: I should look at the schema of the store and sales_fact_1997 tables to see what columns I can query.
Action: schema_sql_db
Action Input: "store, sales_fact_1997"
Observation:
CREATE TABLE sales_fact_1997 (
	product_id INTEGER NOT NULL,
	time_id INTEGER NOT NULL,
	customer_id INTEGER NOT NULL,
	promotion_id INTEGER NOT NULL,
	store_id INTEGER NOT NULL,
	store_sales DECIMAL(10, 4) NOT NULL,
	store_cost DECIMAL(10, 4) NOT NULL,
	unit_sales DECIMAL(10, 4) NOT NULL
)COLLATE latin1_general_ci DEFAULT CHARSET=latin1 ENGINE=MyISAM

/*
3 rows from sales_fact_1997 table:
product_id	time_id	customer_id	promotion_id	store_id	store_sales	store_cost	unit_sales
337	371	6280	0	2	1.5000	0.5100	2.0000
1512	371	6280	0	2	1.6200	0.6318	3.0000
963	371	4018	0	2	2.4000	0.7200	1.0000
*/


CREATE TABLE store (
	store_id INTEGER NOT NULL,
	store_type VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci,
	region_id INTEGER,
	store_name VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci,
	store_number INTEGER,
	store_street_address VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci,
	store_city VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci,
	store_state VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci,
	store_postal_code VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci,
	store_country VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci,
	store_manager VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci,
	store_phone VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci,
	store_fax VARCHAR(30) CHARACTER SET latin1 COLLATE latin1_general_ci,
	first_opened_date DATETIME,
	last_remodel_date DATETIME,
	store_sqft INTEGER,
	grocery_sqft INTEGER,
	frozen_sqft INTEGER,
	meat_sqft INTEGER,
	coffee_bar TINYINT(1),
	video_store TINYINT(1),
	salad_bar TINYINT(1),
	prepared_food TINYINT(1),
	florist TINYINT(1)
)COLLATE latin1_general_ci DEFAULT CHARSET=latin1 ENGINE=MyISAM

/*
3 rows from store table:
store_id	store_type	region_id	store_name	store_number	store_street_address	store_city	store_state	store_postal_code	store_country	store_manager	store_phone	store_fax	first_opened_date	last_remodel_date	store_sqft	grocery_sqft	frozen_sqft	meat_sqft	coffee_bar	video_store	salad_bar	prepared_food	florist
0	HeadQuarters	0	HQ	0	1 Alameda Way	Alameda	CA	55555	USA	None	None	None	None	None	None	None	None	None	0	0	0	0	0
1	Supermarket	28	Store 1	1	2853 Bailey Rd	Acapulco	Guerrero	55555	Mexico	Jones	262-555-5124	262-555-5121	1982-01-09 00:00:00	1990-12-05 00:00:00	23593	17475	3671	2447	0	0	0	0	0
2	Small Grocery	78	Store 2	2	5203 Catanzaro Way	Bellingham	WA	55555	USA	Smith	605-555-8203	605-555-8201	1970-04-02 00:00:00	1973-06-04 00:00:00	28206	22271	3561	2374	1	0	0	0	0
*/
Thought: I should construct a query to get the information I need.
Action: query_checker_sql_db
Action Input: SELECT store.store_name, store.store_state, SUM(sales_fact_1997.store_sales) FROM store, sales_fact_1997 WHERE store.store_id = sales_fact_1997.store_id GROUP BY store.store_name, store.store_state
Observation:

SELECT store.store_name, store.store_state, SUM(sales_fact_1997.store_sales) FROM store INNER JOIN sales_fact_1997 ON store.store_id = sales_fact_1997.store_id GROUP BY store.store_name, store.store_state
Thought: I should execute the query to get the results.
Action: query_sql_db
Action Input: SELECT store.store_name, store.store_state, SUM(sales_fact_1997.store_sales) FROM store INNER JOIN sales_fact_1997 ON store.store_id = sales_fact_1997.store_id GROUP BY store.store_name, store.store_state
Observation: [('Store 2', 'WA', Decimal('4739.2300')), ('Store 3', 'WA', Decimal('52896.3000')), ('Store 6', 'CA', Decimal('45750.2400')), ('Store 7', 'CA', Decimal('54545.2800')), ('Store 11', 'OR', Decimal('55058.7900')), ('Store 13', 'OR', Decimal('87218.2800')), ('Store 14', 'CA', Decimal('4441.1800')), ('Store 15', 'WA', Decimal('52644.0700')), ('Store 16', 'WA', Decimal('49634.4600')), ('Store 17', 'WA', Decimal('74843.9600')), ('Store 22', 'WA', Decimal('4705.9700')), ('Store 23', 'WA', Decimal('24329.2300')), ('Store 24', 'CA', Decimal('54431.1400'))]
Thought: I now know the final answer
Final Answer: <tr><td>Store 2</td><td>WA</td><td>4739.2300</td></tr><tr><td>Store 3</td><td>WA</td><td>52896.3000</td></tr><tr><td>Store 6</td><td>CA</td><td>45750.2400</td></tr><tr><td>Store 7</td><td>CA</td><td>54545.2800</td></tr><tr><td>Store 11</td><td>OR</td><td>55058.7900</td></tr><tr><td>Store 13</td><td>OR</td><td>87218.2800</td></tr><tr><td>Store 14</td><td>CA</td><td>4441.1800</td></tr><tr><td>Store 15</td><td>WA</td><td>52644.0700</td></tr><tr><td>Store 16</td><td>WA</td><td>49634.4600</td></tr><tr><td

> Finished chain.

## Sequential Chains

Let us say that we want to find the median total sales for the stores.

We know that mysql database does not directly support the `median()` function. So let us use the math tool to compute the median sales, after we have retrieved the total sales for the stores.

In [67]:
from langchain.llms import OpenAI
from langchain.chains import LLMChain
from langchain.prompts import PromptTemplate
from langchain.chains import SimpleSequentialChain
from langchain import OpenAI, LLMMathChain

llm = OpenAI(temperature=0)
llm_math = llm_math = LLMMathChain(llm=llm, verbose=True)



overall_chain = SimpleSequentialChain(chains=[agent, llm_math], verbose=True)

In [73]:
query = """
Fetch the total sales of each of the stores as a sorted list of amounts,
then use math to compute the median
"""
overall_chain.run (query)

> Entering new SimpleSequentialChain chain...


> Entering new AgentExecutor chain...
Action: list_tables_sql_db
Action Input: ""
Observation: agg_g_ms_pcat_sales_fact_1997, inventory_fact_1997, agg_l_04_sales_fact_1997, product_class, sales_fact_1997, warehouse, salary, department, inventory_fact_1998, warehouse_class, agg_l_03_sales_fact_1997, agg_ll_01_sales_fact_1997, category, region, position, agg_l_05_sales_fact_1997, agg_lc_100_sales_fact_1997, employee_closure, expense_fact, store, agg_pl_01_sales_fact_1997, currency, reserve_employee, agg_lc_06_sales_fact_1997, product, agg_c_14_sales_fact_1997, customer, sales_fact_1998, store_ragged, agg_c_10_sales_fact_1997, time_by_day, promotion, account, days, agg_c_special_sales_fact_1997, sales_fact_dec_1998, employee
Thought: I should look at the schema of the sales_fact_1997 table to see what columns I can use
Action: schema_sql_db
Action Input: "sales_fact_1997"
Observation:
CREATE TABLE sales_fact_1997 (
	product_id INTEGER NOT NULL,
	time_id INTEGER NOT NULL,
	customer_id INTEGER NOT NULL,
	promotion_id INTEGER NOT NULL,
	store_id INTEGER NOT NULL,
	store_sales DECIMAL(10, 4) NOT NULL,
	store_cost DECIMAL(10, 4) NOT NULL,
	unit_sales DECIMAL(10, 4) NOT NULL
)COLLATE latin1_general_ci DEFAULT CHARSET=latin1 ENGINE=MyISAM

/*
3 rows from sales_fact_1997 table:
product_id	time_id	customer_id	promotion_id	store_id	store_sales	store_cost	unit_sales
337	371	6280	0	2	1.5000	0.5100	2.0000
1512	371	6280	0	2	1.6200	0.6318	3.0000
963	371	4018	0	2	2.4000	0.7200	1.0000
*/
Thought: I should query the total sales of each store, sorted by store_sales
Action: query_sql_db
Action Input: "SELECT store_id, SUM(store_sales) AS total_sales FROM sales_fact_1997 GROUP BY store_id ORDER BY total_sales DESC LIMIT 10"
Observation: [(13, Decimal('87218.2800')), (17, Decimal('74843.9600')), (11, Decimal('55058.7900')), (7, Decimal('54545.2800')), (24, Decimal('54431.1400')), (3, Decimal('52896.3000')), (15, Decimal('52644.0700')), (16, Decimal('49634.4600')), (6, Decimal('45750.2400')), (23, Decimal('24329.2300'))]
Thought: I should use the results to compute the median
Action: None
Final Answer: The median total sales of the stores is 54545.28

> Finished chain.
The median total sales of the stores is 54545.28


> Entering new LLMMathChain chain...
The median total sales of the stores is 54545.28
```text
54545.28
```
...numexpr.evaluate("54545.28")...

Answer: 54545.28
> Finished chain.
Answer: 54545.28

> Finished chain.

'Answer: 54545.28'